# Indexing Operator iloc

In [0]:
import pandas as pd

In [0]:
file = 'titanic.csv'

In [0]:
df = pd.read_csv(file,'\t')

In [4]:
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [5]:
df.tail()

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
151          152         1       1  ...  66.6000    C2         S
152          153         0       3  ...   8.0500   NaN         S
153          154         0       3  ...  14.5000   NaN         S
154          155         0       3  ...   7.3125   NaN         S
155          156         0       1  ...  61.3792   NaN         C

[5 rows x 12 columns]

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 156 entries, 0 to 155
Data columns (total 12 columns):
PassengerId    156 non-null int64
Survived       156 non-null int64
Pclass         156 non-null int64
Name           156 non-null object
Sex            156 non-null object
Age            126 non-null float64
SibSp          156 non-null int64
Parch          156 non-null int64
Ticket         156 non-null object
Fare           156 non-null float64
Cabin          31 non-null object
Embarked       155 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 14.7+ KB

In [7]:
#get the firs row of the DataFrame (index based)
df.iloc[0]

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                                 22
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 0, dtype: object

In [8]:
#we get a Pandas Series
type(df.iloc[0])

pandas.core.series.Series

In [9]:
#get the last row of the DataFrame
df.iloc[-1]

PassengerId                            156
Survived                                 0
Pclass                                   1
Name           Williams, Mr. Charles Duane
Sex                                   male
Age                                     51
SibSp                                    0
Parch                                    1
Ticket                            PC 17597
Fare                               61.3792
Cabin                                  NaN
Embarked                                 C
Name: 155, dtype: object

### Slicing

In [10]:
#getting the last 5 rows
df.iloc[-5:]

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
151          152         1       1  ...  66.6000    C2         S
152          153         0       3  ...   8.0500   NaN         S
153          154         0       3  ...  14.5000   NaN         S
154          155         0       3  ...   7.3125   NaN         S
155          156         0       1  ...  61.3792   NaN         C

[5 rows x 12 columns]

In [11]:
#getting a slice of the data (note that the last index '106' is excluded from the search)
df.iloc[100:106]

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
100          101         0       3  ...   7.8958   NaN         S
101          102         0       3  ...   7.8958   NaN         S
102          103         0       1  ...  77.2875   D26         S
103          104         0       3  ...   8.6542   NaN         S
104          105         0       3  ...   7.9250   NaN         S
105          106         0       3  ...   7.8958   NaN         S

[6 rows x 12 columns]

In [12]:
#getting specific rows by index
df.iloc[[0,67,150]]

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
67            68         0       3  ...   8.1583   NaN         S
150          151         0       2  ...  12.5250   NaN         S

[3 rows x 12 columns]

In [13]:
#slicing a row: getting the first row and the column index 3 (column 'Name')
df.iloc[0,3]

'Braund, Mr. Owen Harris'

In [14]:
#getting the first row and the columns by index (note that the starting point '0' is including and the ending point '6' is excluding)
df.iloc[0,3:6]

Name    Braund, Mr. Owen Harris
Sex                        male
Age                          22
Name: 0, dtype: object

In [15]:
#getting the first row and the columns by index in a list
df.iloc[0,[0,3,4,5,6]]

PassengerId                          1
Name           Braund, Mr. Owen Harris
Sex                               male
Age                                 22
SibSp                                1
Name: 0, dtype: object

In [16]:
#getting all rows and column index 4
df.iloc[:,4]

0        male
1      female
2      female
3      female
4        male
5        male
6        male
7        male
8      female
9      female
10     female
11     female
12       male
13       male
14     female
15     female
16       male
17       male
18     female
19     female
20       male
21       male
22     female
23       male
24     female
25     female
26       male
27       male
28     female
29       male
        ...
126      male
127      male
128    female
129      male
130      male
131      male
132    female
133    female
134      male
135      male
136    female
137      male
138      male
139      male
140    female
141    female
142    female
143      male
144      male
145      male
146      male
147    female
148      male
149      male
150      male
151    female
152      male
153      male
154      male
155      male
Name: Sex, Length: 156, dtype: object

[reference - https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.iloc.html](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.iloc.html)